Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: །ཀྱེ་ཀྱེ་མཁས་པ་ཡེ་ཤེས་རྒྱ་ཆེན་བསླབས།
en: “ ‘Oh! Oh! Wise one, who has a vast training in wisdom,

source: །ཆོས་ཀྱི་རྔ་དག་ཤིན་ཏུ་བརྡུང་བར་མཛོད། །ཀྱེ་ཀྱེ་འཇིག་རྟེན་གྱི་ནི་ཐེ་ཙོམ་གྱི།
en: Beat loudly the drum of the Dharma! Oh! Oh!

source: །འཁྲི་ཤིང་ཐམས་ཅད་ཡེ་ཤེས་རྒྱ་མཚོས་ཆོད།
en: With your ocean of wisdom cut through All the world’s creepers of doubt. Oh! Oh!

source: །ཀྱེ་ཀྱེ་ལེགས་ཐོས་ཆོས་རྣམས་འཛིན་མཛད་པ།
en: You who are excellently learned,

source: །རྡུལ་བྲལ་མདོ་སྡེ་བྱེ་བ་བརྒྱ་དག་ཀྱང་།
en: Stainless, a holder of the Dharma, a supreme human, Oh! Oh!

source: །འཁོར་གྱི་ནང་དུ་གདན་ལ་རབ་བཞུགས་ལ།
en: be seated in the midst of your assembly

source: །མི་མཆོག་མཁས་པ་བརྗོད་པ་མཛད་དུ་གསོལ།
en: And, wise one, recite thousands of millions of stainless sūtras. {xxii}

source: །མེ་ཏོག་ཟླ་བ་མཚན་མཆོག་བརྒྱན་པ་ཀྱེ།
en: “ ‘Ah! Puṣpacandra, you are adorned by the supreme primary signs. Ah!

source: །དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་ཚང་བ་ཀྱེ། །དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུས་ལུས་བརྒྱན་ཀྱེ།
en: Your body has all the eighty excellent secondary signs complete. Ah!

source: །སྲིད་པའི་མཚོ་རྒལ་སྤྲོས་མེད་ཚུར་སྤྱོན་ཀྱེ།
en: Come here, honest one, who has crossed the ocean of existence. Ah!

source: །སྲིད་པའི་བཙོན་རར་ཆུད་ཁྲོལ་བཞེངས་ཤིག་ཀྱེ།
en: Arise, you who have escaped from the prison of existence. Ah!

source: །ཡེ་ཤེས་མཆོག་རིག་ཚངས་པ་འདྲ་བ་ཀྱེ།
en: You have sacred, supreme wisdom and knowledge. Ah!

source: །མེ་ཏོག་ཟླ་བ་ཐུགས་རྗེ་ཆེན་པོ་ཀྱེ།
en: Puṣpacandra, you have great compassion. Ah!

source: །བྱམས་དང་སྙིང་རྗེ་སྐྱེད་ལ་བཞེངས་ཤིག་ཀྱེ།
en: Have love and compassion and arise! Ah! Puṣpacandra, I pray to you. {xxiii} “ ‘Ah!

source: །མེ་ཏོག་ཟླ་བ་ཁྱོད་ལ་གསོལ་བ་འདེབས།
en: Puṣpacandra, give your instruction! Ah!

source: །དགེ་སློང་དགེ་འདུན་ཁྱོད་ཀྱིས་མ་དོར་བར།
en: Do not forsake your saṅgha of bhikṣus! Ah!

source: །ཚུར་གཤེགས་དགེ་འདུན་ཡོངས་སུ་བསྡུ་བ་མཛོད།
en: Come here and lead your saṅgha! Ah!

source: །བཞེངས་ལ་ནགས་ཁྲོད་དེར་ཡང་གཤེགས་སམ་ཀྱེ།
en: Arise and go to that forest! Ah!

source: །མེ་ཏོག་ཟླ་བ་བསམ་གཏན་དགྱེས་པ་མཆོག །མཛའ་དང་མི་མཛའ་མཚུངས་པར་བྱམས་ཤིང་ཕན།
en: Puṣpacandra, you enjoy the four dhyānas. Ah! You have love equally for friends and enemies. Ah!

source: །གཟུངས་ལ་རབ་ཏུ་གནས་པ་ཚུར་སྤྱོན་ཀྱེ།
en: Arise, you who maintain unequaled retention. Ah!

source: །ཡེ་ཤེས་སྡོང་པོ་མཚུངས་མེད་ཁྱོད་བཞེངས་ཤིག །རི་རབ་བཞིན་དུ་མི་གཡོ་བརྟན་པ་ཀྱེ།
en: Come here, arise, you who are a tree of pure wisdom. {xxiv} “ ‘Ah! You are as unshakable as Meru. Ah!

source: །སངས་རྒྱས་སངས་རྒྱས་སེམས་ཅན་མཉམ་ཡིད་ཀྱེ།
en: You for whom buddhas and beings are equal— Ah!

source: །མེ་ཏོག་ཟླ་བ་བརྟུལ་ཞུགས་རྫོགས་པ་ཀྱེ།
en: Puṣpacandra, who has perfect discipline— Ah!

source: །བཞེངས་ལ་ཤིང་གི་དྲུང་དུ་འཚང་རྒྱ་མཛོད།
en: Arise and attain buddhahood at the foot of the Bodhi tree. Ah!

source: །ལྷ་ཡི་རྣ་བ་ཆོས་ཀྱི་མཆོག་འཆང་ཀྱེ།
en: You have divine hearing and possess the supreme Dharma. Ah!

source: །ལྷ་ཡི་མིག་མཁས་ཡེ་ཤེས་རྟོགས་པ་ཀྱེ།
en: You have divine vision, and are wise and adept in wisdom. Ah!

source: །བཞེངས་ཏེ་བདག་ལ་གཟིགས་ཤིག་ཐུགས་རྗེ་ཅན།
en: Arise, compassionate one, and look at me! Ah!

source: །གྲགས་པ་མཐའ་ཡས་བདག་གི་ཚིག་གསོན་ཀྱེ།
en: Endlessly famous one, listen to my words! {xxv} “ ‘Ah!

source: །འཇིག་རྟེན་ཀུན་ལ་ཕན་དང་དོན་མཛད་ཀྱེ།
en: You help and benefit the entire world. Ah!

source: །མེ་ཏོག་ཟླ་བ་ཤིན་ཏུ་སྦྱིན་དགྱེས་ཀྱེ།
en: Puṣpacandra, you delight in great generosity. Ah!

source: །བཞེངས་ལ་མྱུར་དུ་བདག་གི་རེ་རྫོགས་མཛོད།
en: Arise and quickly fulfill my prayer. Ah!

source: །ཁྱོད་འདིར་དུམ་བུ་དུམ་བུར་མ་བཞུགས་ཤིག །གྲོང་འདིར་སྐྱེས་པ་བུད་མེད་ཚོགས་རྣམས་ཀྱང་།
en: Do not remain here in pieces. When the men and the women of this city

source: །ཁྱོད་མཐོང་ཐམས་ཅད་ཤིང་བཞིན་ས་ལ་འགྱེལ།
en: Saw you lying dead,

source: །སྙིང་སྐམས་འགྱུར་བའི་མྱ་ངན་རྣམས་ཀྱང་བགྱིད།
en: Their hearts were withered by sorrow.

source: །ཐུགས་རྗེ་མཆོག་གི་སྤྱན་གྱིས་དེ་ལ་གཟིགས།
en: Look upon them with your compassionate eyes! {xxvi} “ ‘Arise, Supuṣpa, so that you may fulfill

source: །གང་གི་སླད་དུ་བྱམས་པ་བསྒོམས་པ་དང་། །ཡེ་ཤེས་ཤེས་རབ་ཐབས་ཀྱི་སྟོབས་རྣམས་དང་། །ཁྱོད་ཀྱི་ཐུགས་རྗེ་བཏང་སྙོམས་དགའ་བ་ཡངས། །དེ་དག་རྫོགས་མཛོད་བཞེངས་ཤིག་མེ་ཏོག་མཛེས།
en: The reason for cultivating the strength Of love, wisdom, and method, And your vast rejoicing in compassion and equanimity.

source: །ལྷ་ཀླུ་ལྷ་མིན་རྫུ་འཕྲུལ་ཆེན་པོ་དང་། །གནོད་སྦྱིན་སྲིན་པོ་མི་དང་མི་འམ་ཅི།
en: Devas, nāgas, and asuras with great miraculous powers, Yakṣas, rākṣasas, humans, and kinnaras

source: །སྙིམ་པ་མེ་ཏོག་བདུག་པས་བཀང་ནས་ནི།
en: Bring flowers and incense in their cupped hands;

source: །ཐམས་ཅད་མཐོང་བར་དགའ་ནས་ལྷགས་ཤིང་འཁོད།
en: They have all come to delight in seeing you. {xxvii}

source: །དྲང་སྲོང་ཆེན་པོའི་ཚིག་ནི་དེང་རྟོགས་ཏེ།
en: “ ‘Today I have understood the words of the Sage:

source: །སྐྱེ་དགུའི་འདོད་པ་གནོད་བྱེད་གསོད་པ་ཡིན།
en: The desires of beings are harmful murderers.

source: །ཡིད་ཀྱི་ནད་དུ་འགྱུར་བ་ངན་འགྲོའི་རྒྱུ།
en: This fever of the mind is the cause of the lower realms.

source: །དེ་ཕྱིར་འདོད་པའི་སྤྱོད་པ་སྤང་བར་བྱ།
en: Therefore I shall forsake acting out of desire. {107}

source: །དགེ་སློང་བདག་གིས་བསད་པ་སྡིག་གི་ལས།
en: “ ‘I have committed the sin of slaying the bhikṣu,

source: །ཤིན་ཏུ་མ་ལེགས་མི་བདེ་བྱས་པས་ན།
en: Which was extremely wicked and will destroy my happiness.

source: །བདག་ནི་མི་བཟད་དམྱལ་བ་མནར་མེད་འགྲོ།
en: I am going to go to the terrible Avīci hell

source: །བདག་ལ་དེ་ཡི་མགོན་སྐྱབས་བྱེད་པ་མེད།
en: And I have no protector who can save me from that.

source: །བདག་ནི་རྒྱལ་པོའི་སྲིད་བཏང་ཚངས་སྤྱོད་གཞོལ།
en: I shall forsake the kingdom and practice celibacy. I shall make excellent offerings

source: །སྤོས་དང་མེ་ཏོག་བྱུག་པ་རྣམས་ཀྱིས་ནི། །མཆོད་པ་དམ་པ་རྣམས་ཀྱང་རབ་ཏུ་བྱ།
en: With incense, flowers, and perfumes,

source: །ཤིན་ཏུ་མཛེས་པར་མཆོད་རྟེན་བདག་གིས་བྱ།
en: And I shall build a beautiful stūpa. {108} “ ‘I give a command to all my sons,

source: །བུ་དང་བུ་མོ་བུད་མེད་ཁྱིམ་བདག་དང་། །བློན་པོ་དང་ནི་ཚོང་དཔོན་དེ་དག་དང་། །གྲོང་པ་དང་ནི་རྒྱལ་རིགས་མང་པོ་རྣམས། །དེ་དག་ཐམས་ཅད་ལ་ནི་ངས་བསྒོ་བ།
en: Daughters, wives, prominent citizens, Ministers, head merchants, Heads of guilds, and many kṣatriyas:

source: །ཨ་ག་རུ་དང་ཙན་དན་ཤུག་པ་དང་། །ཤིན་ཏུ་ཞིམ་པའི་སྤོས་མཆོག་ཅི་ཡོད་པས། །མྱུར་དུ་སྒྲོམ་གྱི་སྙིང་པོའི་ཁྱོགས་ཆོས་ལ།
en: Quickly make a bier with a casket Of agarwood, sandalwood, cherry wood, And whatever is splendid, aromatic, and beautiful,

source: །དགེ་སློང་འདི་ནི་བསྲེགས་པའི་ཆོ་ག་གྱིས།
en: For the cremation of this bhikṣu.’ {109}

source: །གྲོང་ཁྱེར་མི་ཀུན་རྒྱལ་པོའི་ཚིག་ཐོས་ནས།
en: “Having heard the king, all the townspeople

source: །སྤོས་མཆོག་དག་ཀྱང་ཐོགས་ནས་ཁྱོགས་བཅས་ཏེ།
en: Brought the very best incense,

source: །སྤོས་རབ་བཟང་པོ་ཡིད་དུ་འོང་ལས་བྱས།
en: Fashioned a bier, and placed

source: །དེར་ནི་དགེ་སློང་དེར་ཡང་བཅུག་ནས་སུ།
en: The bhikṣu inside the casket.

source: །ཨ་ག་རུ་དང་ཙན་དན་ཙམ་པ་ཀ།
en: With agarwood, sandalwood, and magnolia,

source: །རྒྱ་སྤོས་སྤྲི་ཀ་དེ་བཞིན་པ་ཏ་ལ།
en: Valerian, fenugreek, and begonia,

source: །མེ་ཏོག་དང་ནི་ཕྲེང་བ་བྱུག་པ་དག །ཤིན་ཏུ་བཟང་དང་འབྲུ་མར་དག་གིས་བསྲེགས།
en: With flowers and perfumed garlands, And with sesame oil he was cremated. {110} “The bhikṣus collected

source: །དེ་ཡི་རུས་པ་སྒྲོམ་ནི་བྱས་པར་གྱུར། །དགེ་སློང་དག་གིས་དེ་ཡང་དེར་བསྲེགས་ཏེ།
en: A droṇa of his burned bones.

source: །རྒྱལ་པོས་དེ་ཡི་མཆོད་རྟེན་བྱས་ནས་སུ།
en: The king created for them a stūpa

source: །འདི་ལ་ངས་ནི་མཆོད་པ་བྱ་ཞེས་ཟེར།
en: And said, ‘I wish to make an offering to it.’

source: །མེ་ཏོག་དང་ནི་ཕྲེང་བ་བྱུག་པ་དང་། །གདུགས་དང་བ་དན་རྒྱལ་མཚན་ཐོགས་ནས་སུ།
en: Holding flowers, garlands, and perfumes,

source: །རྒྱལ་པོས་དེར་ནི་སིལ་སྙན་སྟོང་དག་དང་། །བྱེ་བ་ཁྲག་ཁྲིག་རྣམས་ཀྱང་ལེན་དུ་བཙུད།
en: The king had others hold parasols, flags, and banners, And play the music of a thousand Quintillion musical instruments. {111}

source: །ཉི་མ་གཅིག་ལ་རྒྱལ་པོ་དུས་གསུམ་དུ། །དགེ་སློང་དེ་ཡི་མཆོད་རྟེན་དེ་དྲུང་དུ།
en: “The king came to the stūpa of the bhikṣu During each of the three periods of every day,

source: །སྡིག་པ་སྔན་ཅད་ཅུང་ཟད་ཅི་བྱས་པ།
en: And confessed absolutely whatever bad actions, however small,

source: །དེ་ཚེ་དུས་གསུམ་དུ་ཡང་ཤིན་ཏུ་འཆགས།
en: He may have committed in this life or throughout the three times.

source: །ལོ་སྟོང་བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་ལྔར།
en: For nine hundred and fifty billion years

source: །ཉེས་པ་བྱས་པ་དག་ཀྱང་རབ་བཤགས་ཏེ།
en: He repented all his misdeeds,

source: །ཕྱིས་ཀྱང་ཚུལ་ཁྲིམས་དམ་པ་མ་རལ་བསྲུངས།
en: And from then on perfectly maintained correct conduct

source: །རྣམ་པར་དག་ཅིང་གཙང་ལ་དྲི་མ་མེད།
en: That was unimpaired, pure, unsullied, and stainless. {112}

source: །གསོ་སྦྱོང་དག་ཀྱང་དེ་ཚེ་རབ་གསོས་ཏེ།
en: He kept the poṣadha vows.

source: །དེ་ནི་དེ་ཚེ་བདག་གི་ལུས་ཞིག་ནས།
en: Then when my body was destroyed

source: །མནར་མེད་མི་བཟད་པར་ནི་དེ་ལྷུང་གྱུར།
en: I fell into the terrible Avīci Hell.

source: །འདོད་ཕྱིར་སྙིང་རྗེ་མེད་པའི་ལས་བྱས་པས།
en: I had committed cruel actions out of desire

source: །སྡུག་བསྔལ་མང་པོ་དག་ཀྱང་མྱོང་བར་གྱུར།
en: And therefore I experienced many sufferings. I had displeased nine hundred

source: །སངས་རྒྱས་བྱེ་བ་སྟོང་ཕྲག་དགུ་བཅུ་ལྔ། །དེ་ཚེ་དེ་དག་བདག་གིས་མ་མཉེས་བྱས།
en: And fifty billion buddhas. {113}

source: །ལོ་སྟོང་བྱེ་བ་ཁྲག་ནི་དགུ་བཅུ་ལྔར།
en: “For nine hundred and fifty billion years

source: །དེ་ཡི་ཚེ་ན་ང་ནི་ལོང་བར་གྱུར།
en: I was blind throughout that time.

source: །བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་དྲུག་ཅུ་གཉིས།
en: For sixty-two quintillion eons

source: །སྔན་ཆད་ང་ཡི་མིག་ཀྱང་བཅར་བར་གྱུར།
en: In the past my eyes were destroyed.

source: །བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་སྟོང་དང་། །ཤིན་ཏུ་མང་བར་ང་ཡི་མིག་ཕྱུང་ཕྲོགས།
en: For many thousand quintillions Of eons, my eyes were gouged out. For countless millions of eons,

source: །མགོ་དང་རྣ་བ་དང་ནི་རྐང་ལག་ཀྱང་། །བསྐལ་པ་མཐའ་ཡས་ཁྲག་ཁྲིག་བཅད་པར་གྱུར།
en: My head, ears, feet, and hands were cut off. {114}

source: །བསྐལ་པ་དག་ནི་བྱེ་བ་ཁྲག་ཁྲིག་ཏུ།
en: “For another quintillion eons

source: །མིར་གྱུར་པ་དང་སྐྱེ་བ་གཞན་དུ་ཡང་།
en: I was born into human lives

source: །འཁོར་བའི་སྡུག་བསྔལ་དག་གིས་རབ་གཙེས་ཤིང་།
en: In which I experienced suffering,

source: །སྡུག་བསྔལ་ཚོར་བ་ཡུན་རིང་མྱོང་བར་གྱུར། །སྡིག་པའི་ལས་རྣམས་བྱས་པས་འཁོར་བ་ན།
en: Tormented for a long time by saṃsāra’s suffering.

source: །ཡུན་རིང་ཤིན་ཏུ་སྡུག་བསྔལ་མྱོང་བར་གྱུར།
en: For a long time in saṃsāra I experienced The suffering created by my bad actions.

source: །སྲིད་པ་གསུམ་དུ་སྡིག་པ་མི་བྱའོ།
en: Should commit no bad actions within the three realms. {115}

source: །རྒྱལ་པོ་མཆོག་གིས་སྔོན་གྱི་ལས་བཤགས་ཀྱང་།
en: “Although the supreme king confessed his past action,

source: །སྔ་མའི་ཉེས་བྱས་རྣམས་ལས་དེ་མ་ཐར།
en: He was not freed from the evil that he had done.

source: །མི་བཟད་གཟུགས་ཀྱི་ལས་རྣམས་སྔར་བྱས་པས།
en: Because he had created such terrible karma,

source: །དེ་ཤི་དམྱལ་བ་མི་བཟད་མནར་མེད་སོང་།
en: When he passed away he fell to the terrible Avīci hell. {116} “While I was practicing bodhisattva conduct,

source: །ང་ཡི་རྣ་བ་དེ་བཞིན་རྐང་ལག་བཅད། །བསྐལ་པ་མཐའ་ཡས་མང་པོར་སྣ་ཡང་བཅད།
en: For many endless eons my hands, feet, ears, and nose Were cut off and my eyes were forcefully gouged out

source: །སྤྱོད་པ་སྤྱོད་ཚེ་མཚོན་ཆ་དབྱུག་ཐོགས་ནས། །འདེབས་བྱེད་ནན་གྱིས་ང་ཡི་མིག་ཀྱང་ཕྱུང་།
en: While I was being hit with sticks and weapons. {117}

source: །བྱང་ཆུབ་ཕྱིར་ནི་མགོ་ལག་ལུས་བཅད་དང་། །བུ་དང་ཆུང་མ་མིག་དང་རང་གི་ཤ།
en: “For the sake of enlightenment I gave away my body, head, and hands, My sons, my wives, my eyes, and my flesh.

source: །རྐང་ལག་དགའ་བའི་སེམས་ཀྱིས་ཡོངས་བཏང་ཡང་།
en: I joyfully gave away my feet and my hands,

source: །སྔོན་གྱི་སྡིག་པའི་ལས་ནི་ཟད་མ་གྱུར།
en: But even that did not exhaust my previous bad karma. {118}

source: །ཀུན་དགའ་དེ་ལྟར་བསྐལ་པ་མཐའ་ཡས་སྤྱོད།
en: “Ānanda, that is how I practiced for endless eons.

source: །སངས་རྒྱས་དཔལ་སྟུག་དཔག་ཏུ་མེད་པ་མཐོང་།
en: I saw countless buddhas endowed with glory. Those are the sufferings I experienced in the past

source: །བྱང་ཆུབ་སྤྱོད་མཆོག་འདི་ནི་སྤྱོད་པ་ན། །དེ་ཚེ་སྡུག་བསྔལ་འདི་དག་སྔོན་མྱོང་གྱུར།
en: While practicing this supreme bodhisattva conduct. {121}

source: །བྱང་ཆུབ་སེམས་དཔའ་གཟུངས་ལ་གང་གནས་ཤིང་།
en: “The bodhisattva who maintains retention

source: །བྱམས་སྤྱོད་རྟག་ཏུ་མི་གཡོ་མི་འགུལ་བ།
en: Remains loving, always unwavering and unshakable,

source: །སངས་རྒྱས་རྡུལ་སྦྱངས་ལྷ་ཡི་ལྷ་མཆོད་ནས།
en: Makes offerings to the buddhas, the purified gods of gods,

source: །དེ་དག་ནམ་ཡང་ངན་སོང་སར་མི་འགྲོ།
en: And will never go to the lower realms. {122} “The one who wishes to become a buddha, a lord of the Dharma

source: །སུམ་ཅུ་རྩ་གཉིས་མཚན་གྱིས་གོ་བགོས་པ། །ཆོས་རྗེ་སངས་རྒྱས་བདག་འགྱུར་སུ་འདོད་པ།
en: Who is adorned by the thirty-two signs,

source: །ཚུལ་ཁྲིམས་མ་འདྲེས་གཡོ་བ་མེད་པར་སྲུངས།
en: Should maintain unsullied, uninterrupted correct conduct,

source: །གཟུངས་ལ་རབ་གནས་ཆོས་ཀྱང་བསྟན་པར་གྱིས།
en: And be established in the retention of the Dharma that has been taught. {123}

source: །ང་ནི་དེ་ཚེ་རྒྱལ་པོ་དཔེས་བྱིན་ཡིན།
en: “I was at that time King Śūradatta.

source: །ང་ཡི་བུ་རྣམས་ཕྱི་དུས་ཆོས་སྐྱོང་བ།
en: My sons were subsequently protectors of the Dharma.

source: །མེ་ཏོག་ཟླ་མཛེས་པད་མ་བླ་མ་ཡིན།
en: Padmottara was Supuṣpacandra,

source: །དགའ་བྱེད་དེ་ནི་ཞི་བའི་རྒྱལ་བར་གྱུར།
en: And Vasunandi was Śāntirāja with the ten strengths. {119}

source: །འཇིག་རྟེན་གསུམ་དཔའ་འགྲོ་བའི་གཉེན་གཅིག་པ། །དེ་བཞིན་གཤེགས་པ་རྐང་གཉིས་གཙོ་བོར་གྱུར།
en: “The Tathāgata was the principal human, A hero for the three worlds, the sole friend of beings.

source: །སྐྱེ་དགུ་དག་གི་དོན་ཆེན་མཛད་ནས་ནི།
en: He accomplished a vast benefit for beings.

source: །མར་མེ་བཞིན་དུ་འདྲེན་པ་མྱ་ངན་འདས།
en: He passed into nirvāṇa and was a guide like a lamp. {i}

source: །བུད་མེད་ཚོགས་དང་རྒྱལ་རིགས་མང་པོ་དང་། །ཁྱིམ་བདག་དང་ནི་བློན་པོ་སྟོབས་ཆེན་དང་། །ཚོང་དཔོན་དེ་བཞིན་གྲོང་བའི་མཁར་གྱི་རྒྱལ།
en: “The host of women and the multitude of kṣatriyas, The leading citizens, the generals, and the ministers, The heads of guilds, head merchants, and regional commanders

source: །ཐམས་ཅད་སྟོབས་བཅུ་ཉོན་མོངས་མེད་པར་གྱུར།
en: All gained the ten strengths and freedom from the kleśas.” {120}

source: །མེ་ཏོག་ཟླ་མཛེས་ཀྱི་ལེའུ་སྟེ་སུམ་ཅུ་རྩ་དྲུག་པའོ།། །།དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ། གཞོན་ནུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཅི་ནས་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་བདེ་བར་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་ན།
en: Conclusion of the thirty-sixth chapter, “Supuṣpacandra.” Teaching the Aggregate of Correct Conduct Chapter 37

source: གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེས་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མཉམ་པ་ཉིད་རྣམ་པར་སྤྲོས་པའི་ཏིང་ངེ་འཛིན་འདི་མཉན་པར་བྱ། གཟུང་བར་བྱ། ཀུན་ཆུབ་པར་བྱ། བཅང་བར་བྱ། བཀླག་པར་བྱ། རབ་ཏུ་གདོན་པར་བྱ། ལུང་མནོད་ཅིང་ཁ་ཏོན་དུ་བྱ། ཉོན་མོངས་པ་མེད་པའི་བསྒོམ་པས་མང་དུ་བསྒོམ་པར་བྱ།
en: Then the Bhagavān said to the youth Candraprabha, “Therefore, young man, bodhisattva mahāsattvas who wish to attain quickly the highest, complete enlightenment of perfect buddhahood should hear the samādhi, the revealed equality of the nature of all phenomena, should obtain it, study it, keep it, recite it, disseminate it, transmit it, chant it, meditate on it with unadulterated meditation, and in other ways make it widely known.

source: གཞན་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་བྱའོ། །ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་ལ་ཡང་རབ་ཏུ་གནས་པར་བྱའོ།
en: They should also maintain the aggregate of correct conduct.”

source: །དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསུངས་སོ།
en: Thereupon the Bhagavān recited the following verses:

source: །བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་ཁྲིམས་ཚོགས་གནས་ཤིང་།
en: “Bodhisattvas who maintain the aggregate of correct conduct,

source: །བདག་ལ་ཕན་སེམས་སྤྱད་པ་གང་སྤྱོད་པ།
en: Who practice the conduct wishing for benefit,

source: །མངོན་དགའི་སངས་རྒྱས་ཞིང་དུ་མྱུར་སོང་ནས།
en: Will quickly go to the Abhirati buddha realm,

source: །བཟོད་པ་དེས་ཐོབ་ཆོས་ཀྱི་རྒྱལ་པོར་འགྱུར།
en: Attain patience, and become kings of the Dharma. {1}

source: །དེ་ཕྱིར་གནོད་སེམས་མེད་ཅིང་ཀུན་འཐུན་གྱིས།
en: “Therefore, be agreeable without malice,

source: །ཐམས་ཅད་རྟག་ཏུ་ཡིད་དུ་འོང་བར་བགྱིས།
en: And always be pleasant to everyone.

source: །དཔལ་སྟུག་སངས་རྒྱས་དཔག་མེད་མཐོང་ནས་ནི།
en: Having seen countless glorious buddhas

source: །བྱང་ཆུབ་རེག་ནས་ཆོས་ཀྱི་བདག་པོར་འགྱུར།
en: You will reach enlightenment and become a lord of Dharma. {2}

source: །དེ་ཕྱིར་ཕན་ཡོན་མཆོག་འདི་ཐོས་ནས་ནི།
en: “Therefore, having heard this supreme benefit,

source: །དགེ་སློང་ཚུལ་ཁྲིམས་མཆོག་དང་ལྡན་མཐོང་ན།
en: And having seen bhikṣus who have excellent correct conduct,

source: །མཁས་པས་གཡོ་མེད་རྟག་ཏུ་བསྟན་པར་བྱ།
en: A wise person would always depend upon them

source: །རིང་པོར་མི་ཐོགས་ཏིང་འཛིན་འདི་འཐོབ་འགྱུར།
en: And quickly become one who has attained the samādhi. {3}

source: །གལ་ཏེ་གཏེར་རྣམས་དཔག་མེད་ཚད་ཀྱང་མེད།
en: “If there were an incalculable, immeasurable treasure

source: །རིན་ཆེན་སྣ་བདུན་ནོར་བུས་གང་གྱུར་པ།
en: Filled with the seven precious jewels,

source: །དེ་བཞིན་ཞིང་རྣམས་གང་གཱའི་བྱེ་མ་སྙེད།
en: And if there were realms as numerous as the sands of the Ganges

source: །ནོར་བུ་རིན་པོ་ཆེ་ཡིས་གང་བ་རྣམས།
en: That were filled with those precious jewels, {4}

source: །བྱང་ཆུབ་སེམས་དཔའ་སྦྱིན་ལ་མོས་པ་ཡིས།
en: “And if there were a bodhisattva who aspired to generosity,

source: །ཉིན་མཚན་རེ་རེར་སྦྱིན་པ་འདི་དག་བྱིན།
en: Who made a gift of these every single day, And made this gift continuously

source: །དེ་བཞིན་བསྐལ་པ་གང་གཱའི་བྱེ་མ་སྙེད།
en: For as many eons as there are sands of the Ganges, {5} “That entire gift would not produce a fraction

source: །རྒྱུན་མི་འཆད་པར་སྦྱིན་པ་བྱིན་པ་བས།
en: Of the accumulation of merit that is obtained

source: །བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་ཏིང་འཛིན་འདི། །ཐོས་ནས་བདེ་གཤེགས་མཛོད་མཆོག་འཛིན་བྱེད་པ། །བསོད་ནམས་ཕུང་པོ་དེས་ནི་གང་བཟུང་བ། །སྦྱིན་པ་དེ་ཀུན་དེ་ཡི་ཆར་མི་ཕོད། །མི་གང་རྗེས་སུ་འཐུན་ལ་དད་པ་དག །ཏིང་འཛིན་རྡུལ་བྲལ་མཆོག་འདི་འཛིན་པ་ནི། །བསོད་ནམས་ཕུང་པོ་དཔེ་མེད་མཆོག་འདི་ཡིན།
en: By the bodhisattva who, having heard this samādhi, Becomes a holder of this supreme treasure of the sugatas. {6} “This supreme, incomparable accumulation of merit

source: །ཡེ་ཤེས་མཛོད་དེ་དཔག་མེད་འབྱུང་གནས་སོ།
en: Is the source of the immeasurable treasure of wisdom. A person who has the appropriate faith

source: །ཏིང་འཛིན་རྡུལ་བྲལ་ཞི་བ་འདི་བཟུང་ན།
en: Should possess this supreme, stainless samādhi. {7}

source: །བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ནོར་ཆེན་འགྱུར།
en: “Bodhisattvas will have great riches Through possessing this stainless peace of samādhi.

source: །རྒྱ་མཚོ་ཆེན་པོ་བཞིན་དུ་ཐོས་པའི་གཏེར།
en: They will be a great ocean of the wealth of hearing the Dharma.

source: །དེ་ལ་བསོད་ནམས་ཚད་ཡོད་ཡོང་མི་འགྱུར།
en: The merit of this is beyond any measure. {8} “Bodhisattvas are said to be those who have become developed

source: །ཆོས་ཀྱི་མཆོག་རྣམས་བསམ་གྱིས་མི་ཁྱབ་པས། །ཤིན་ཏུ་རྒྱས་བྱས་བྱང་ཆུབ་སེམས་དཔར་བརྗོད།
en: Through the supreme, inconceivable Dharma.

source: །ཏིང་འཛིན་འདི་ནི་སུ་དག་སྟོན་བྱེད་པ། །དེ་ནི་ནམ་ཡང་བྱང་ཆུབ་ཐེ་ཚོམ་མེད།
en: The ones who teach this samādhi Never doubt enlightenment. {9} “The ones who have become teachers for the world, guides, Buddhas, self-arisen, having great compassion,

source: །བསོད་ནམས་ཕུང་པོ་མཆོག་དང་གང་ལྡན་ཞིང་།
en: Have attained a supreme accumulation of merit,

source: །གང་ལ་ཚད་མེད་བསམ་གྱིས་མི་ཁྱབ་པ།
en: Which is inconceivable and beyond any measure. {10}

source: །འཇིག་རྟེན་སློབ་དཔོན་སངས་རྒྱས་རྣམ་པར་འདྲེན།
en: “In this billion-world universe there is not to be found

source: །རང་བྱུང་ཐུགས་རྗེ་ཆེན་པོ་མ་གཏོགས་པར། །དེ་ཡི་འོག་ཏུ་སེམས་ཅན་སུ་དག་ཀྱང་།
en: Any being superior to them,

source: །སྟོང་ཆེན་འདི་ནི་བསོད་ནམས་ཕུང་པོ་དང་། །མཚུངས་མེད་བསམ་གྱིས་མི་ཁྱབ་ཡེ་ཤེས་ཀྱིས།
en: Or who is their equal in the accumulation of merit And unrivaled, inconceivable wisdom. {11}

source: །མཉམ་པར་གྱུར་པ་ནམ་ཡང་ཡོང་མེད་དོ།
en: “There is no one who can equal their wisdom

source: །ཏིང་འཛིན་འདི་ནི་ཐོས་ནས་འཛིན་པ་དང་། །ཀློག་ཅིང་ཡོངས་སུ་ཆུབ་པར་བྱེད་པ་དང་། །མཚུངས་མེད་སངས་རྒྱས་བྱང་ཆུབ་ཚོལ་མ་གཏོགས།
en: Other than one who has heard this samādhi, Possesses it, recites it, and understands it, And seeks the unequaled enlightenment of buddhahood. {12}

source: །དེ་ཡི་ཡེ་ཤེས་མཚུངས་པ་མེད་པར་འགྱུར།
en: “Young man, if the amount of merit that is obtained

source: །ཏིང་འཛིན་འདི་ནི་བཟུང་ཞིང་བཀླགས་པ་ཡིས། །བསོད་ནམས་ཕུང་པོ་ཇི་སྙེད་བསགས་པ་ཡང་།
en: By those who possess and recite this samādhi

source: །གཞོན་ནུ་ཇི་སྟེ་ཆོས་དེ་གཟུགས་ཡོད་ན།
en: Were to become a phenomenon that has form,

source: །འཇིག་རྟེན་ཁམས་མང་འདིར་ཡང་ཤོང་མི་འགྱུར།
en: It would be too great to be contained within these many worlds. {13}

source: །གཞོན་ནུ་དེ་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་གང་།
en: “Therefore, young man, the bodhisattvas

source: །འདས་དང་འབྱུང་བའི་དེ་བཞིན་གཤེགས་པ་དང་། །སངས་རྒྱས་ཐམས་ཅད་མཆོད་པར་འདོད་པ་ཡིས།
en: Who wish to make an offering to all the buddhas, The tathāgatas of the past and present,

source: །ཏིང་འཛིན་འདི་ནི་གཟུང་ཞིང་བཀླག་པར་གྱིས།
en: Should possess and recite this samādhi. {14}

source: །དེ་བཞིན་གཤེགས་པའི་བྱང་ཆུབ་འདི་ཡིན་ཏེ།
en: “This is the enlightenment of the tathāgatas.

source: །གཞོན་ནུ་ང་ཡི་ཚིག་ལ་དད་པར་གྱིས།
en: Young man, have faith in my words.

source: །དེ་བཞིན་གཤེགས་པ་བརྫུན་གྱི་ཚིག་མི་གསུང་།
en: The tathāgata does not speak untrue words;

source: །འདི་འདྲའི་སེམས་ཅན་བརྫུན་དུ་སྨྲ་བ་མེད།
en: He does not tell lies, like beings do. {15}

source: །སྔོན་གྱི་བསྐལ་པ་བརྒྱ་ཕྲག་བསམ་ཡས་སུ།
en: “Throughout countless hundreds of eons in the past I purified myself of believing in a self

source: །བྱང་ཆུབ་སྤྱད་པ་མཆོག་འདི་རབ་སྤྱོད་ཅིང་།
en: And practiced the supreme bodhisattva conduct

source: །ཏིང་འཛིན་འདི་ནི་ཡོངས་སུ་ཚོལ་བའི་ཕྱིར། །ངས་ནི་བདག་ཏུ་ལྟ་བ་འདིར་སྦྱངས་སོ།
en: Because I was seeking this samādhi. {16}

source: །དེ་ཕྱིར་ཆོས་ཀྱི་མཛོད་འདི་མཉན་པར་གྱིས།
en: “Therefore listen to this treasure of the Dharma

source: །འདི་ལས་མདོ་སྡེ་བྱེ་བ་ཁྲག་ཁྲིག་འབྱུང་།
en: From which trillions of sūtras arise.

source: །འདི་ནི་བསོད་ནམས་ཕུང་པོ་བསམ་ཡས་ཡངས།
en: This is a vast, inconceivable aggregation of merit

source: །འདིས་ནི་སངས་རྒྱས་ཡེ་ཤེས་མྱུར་དུ་འཐོབ།
en: Through which buddha wisdom will quickly be attained. {17}

source: །མཁས་པ་འཇིགས་མེད་དེ་དག་གང་སྟོན་པ།
en: “That which is taught by the wise, fearless ones

source: །འདི་ནི་མདོ་སྡེ་ཀུན་གྱི་དམ་པའི་མདོ།
en: Is the supreme sūtra among all sūtras

source: །དགེ་བ་བསམ་གྱིས་མི་ཁྱབ་འབྱུང་གནས་ཏེ།
en: And the source of inconceivable virtues.

source: །ཆོས་དེ་རྣམས་ལ་མཐའ་ཐུག་རྙེད་མི་འགྱུར།
en: It is a Dharma for which no end can be found. {18}

source: །སྟོང་ཆེན་དག་ནི་བཅད་ཅིང་བཤིག་ནས་སུ།
en: “It may be possible to break apart and cut to pieces

source: །རྡུལ་གྱི་ཚོགས་རྣམས་བགྲང་བར་ནུས་ན་ཡང་།
en: A billion-world universe and count its atoms, But it is not possible to count the innumerable

source: །མདོ་སྡེ་བརྒྱ་ཕྲག་བསམ་ཡས་ཚད་མེད་པ།
en: Hundreds of sūtras that they constantly teach. {19}

source: །རྒྱུན་མི་ཆད་པར་དེ་སྟོང་བགྲང་མི་ནུས།
en: “It may be possible to count the inhalations and exhalations

source: །སངས་རྒྱས་ཞིང་གི་སེམས་ཅན་ཐམས་ཅད་ཀྱི།
en: Of all the beings that are in this buddha realm,

source: །ཕྱི་ནང་རྒྱུ་བའི་དབུགས་ནི་བགྲང་ནུས་ཀྱང་།
en: But it is not possible to know the limit of the sūtras

source: །ཏིང་འཛིན་འདི་ལ་གནས་ནས་གང་སྟོན་པ།
en: Taught by those who are established in this samādhi. {20}

source: །མདོ་སྡེ་དེ་དག་མཐར་ཐུག་ནུས་མི་འགྱུར།
en: “It may be possible to count the beings

source: །སངས་རྒྱས་ཞིང་ནི་གང་གཱའི་བྱེ་མ་སྙེད།
en: In as many buddha realms as there are Ganges sands,

source: །འགྲོ་བ་དེར་ཡང་སེམས་ཅན་གང་སྐྱེས་པ། །དེ་དག་སེམས་ནི་བགྲང་བར་ནུས་ཀྱང་སྲིད།
en: And the thoughts that arise in those beings’ minds,

source: །རྟག་སྟོན་མདོ་སྡེ་དེ་དག་བགྲང་མི་ནུས།
en: But the sūtras constantly taught by such people cannot be counted. {21}

source: །རྒྱ་མཚོ་ཆེན་པོའི་བྱེ་མ་ཅི་ཡོད་དང་། །ཀླུང་དང་མཚེའུ་དང་གཤོང་གི་བྱེ་མ་དག །བསྐལ་པ་བྱེ་བ་དག་གིས་བགྲང་ནུས་ཀྱང་།
en: “One may be able to count, over millions of eons, All the grains of sand in the great ocean, And of sand in the rivers, ponds, and pits,

source: །དེ་དག་འཆད་པའི་མདོ་སྡེ་མཐའ་ཡས་སོ།
en: But one cannot know the extent of the sūtras they expound. {22}
